[
  {
    "context": "whatsapp",
    "conversations": [
      {
        "user_query": "How do I change my WhatsApp profile picture?",
        "assistant_response": "I'll help you change your WhatsApp profile picture step by step:\n\n1. Open WhatsApp on your phone\n2. Look for three dots in the top-right corner and tap them\n3. Tap \"Settings\" from the menu\n4. Tap on your name at the top of the settings page\n5. Tap on your current profile picture\n6. Choose \"Camera\" to take a new photo or \"Gallery\" to pick an existing one\n7. If you chose Gallery, find the photo you want and tap it\n8. Adjust the crop by moving the square around your face\n9. Tap \"Done\" or the checkmark to save\n\nDon't worry if it takes a few tries - this is normal! The most important thing is to tap your profile picture in settings to start the process.",
        "metadata": {}
      }
    ]
  },
  {
    "context": "whatsapp",
    "conversations": [
      {
        "user_query": "I want to send a message to my daughter but I can't find her name",
        "assistant_response": "I understand - let me help you find your daughter's chat:\n\n1. Open WhatsApp (the green app with a white phone icon)\n2. You'll see a list of your recent conversations\n3. If you don't see her name, look for a magnifying glass icon at the top - tap it\n4. Type your daughter's name slowly and carefully\n5. Her name should appear below as you type\n6. Tap on her name when you see it\n7. Now you can type your message in the box at the bottom\n8. Tap the green arrow button to send\n\nIf you still can't find her, she might be further down in your chat list. You can scroll down slowly to look for her name. Remember, the most recent conversations appear at the top.",
        "metadata": {}
      }
    ]
  },
  {
    "context": "phone",
    "conversations": [
      {
        "user_query": "How do I call my doctor in an emergency?",
        "assistant_response": "For emergency calls to your doctor, here's the safest way:\n\n1. Find the Phone app on your home screen (usually has a green phone icon)\n2. Tap to open it\n3. Look for \"Contacts\" at the bottom and tap it\n4. You should see \"Emergency Contacts\" at the top with red heart symbols\n5. Find your doctor's name in this emergency section\n6. Tap the red phone button next to their name\n\nIMPORTANT: If this is a life-threatening emergency, call 911 first by:\n- Opening the Phone app\n- Tapping \"Dial\" \n- Typing 9-1-1\n- Tapping the green call button\n\nYour doctor's emergency contact should only be used for urgent medical questions, not life-threatening situations. When in doubt, always call 911 first.",
        "metadata": {}
      }
    ]
  },
  {
    "context": "phone",
    "conversations": [
      {
        "user_query": "The phone is ringing but I don't know how to answer it",
        "assistant_response": "Don't panic! Here's how to answer your phone:\n\n1. When you see the incoming call screen, look for a green phone icon\n2. If you see a green button, tap it once\n3. If you see a green circle, swipe it to the right\n4. Put the phone up to your ear to talk\n\nTo end the call when you're done:\n1. Look for a red phone icon or red circle\n2. Tap it once to hang up\n\nTIPS:\n- Answer within the first few rings if possible\n- If you miss the call, don't worry - they can call back\n- Speak clearly and hold the phone close to your ear\n- If you accidentally hang up, you can call them back using the recent calls list\n\nPractice makes perfect - don't worry if it feels awkward at first!",
        "metadata": {}
      }
    ]
  },
  {
    "context": "settings",
    "conversations": [
      {
        "user_query": "The text on my phone is too small, how do I make it bigger?",
        "assistant_response": "I'll help you make the text larger so it's easier to read:\n\n1. Find the \"Settings\" app on your phone (looks like a gear or cog)\n2. Tap to open Settings\n3. Look for \"Display\" or \"Display & Brightness\" and tap it\n4. Find \"Text Size\" or \"Font Size\" and tap it\n5. You'll see a slider with \"A\" letters - the bigger A makes text larger\n6. Move the slider to the right to make text bigger\n7. You'll see a preview showing how the text will look\n8. When you're happy with the size, you can go back\n\nALTERNATIVE PATH:\n1. Go to Settings\n2. Look for \"Accessibility\" and tap it\n3. Find \"Display & Text Size\"\n4. Choose \"Larger Text\"\n5. Turn on \"Larger Accessibility Sizes\" for even bigger text\n\nThe text will now be larger in most of your apps, making everything easier to read!",
        "metadata": {}
      }
    ]
  },
  {
    "context": "whatsapp",
    "conversations": [
      {
        "user_query": "I opened WhatsApp but I don't see any messages",
        "assistant_response": "That's okay! If you don't see messages, it might mean you haven't received any recently, or they might be in a different tab. Do you see any tabs at the bottom like \"Chats\", \"Status\", or \"Calls\"?"
      },
      {
        "user_query": "I see \"Chats\" at the bottom",
        "assistant_response": "Perfect! Tap on \"Chats\" and that should show you all your message conversations. If you still don't see any messages, that just means no one has sent you messages recently. Would you like me to help you send a message to someone?"
      },
      {
        "user_query": "Yes, I want to message my son",
        "assistant_response": "Great! To message your son: 1) Look for a green circular button with a message icon (usually in the bottom-right corner), 2) Tap it, 3) Look for your son's name in the contact list, 4) Tap his name, 5) Type your message in the box at the bottom, 6) Tap the green send arrow. Let me know if you get stuck on any step!"
      }
    ],
    "metadata": {}
  }
]